In [1]:
import pandas as pd

items = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
         {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5},
         {'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

store_items = pd.DataFrame(items, index = {'store 1', 'store 2', 'store 3'})
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0
store 3     20     30       35      4.0

In [2]:
# Drop nan values
store_items.dropna(axis = 0)

         bikes  pants  watches  glasses
store 2     15      5       10     50.0
store 3     20     30       35      4.0

In [3]:
# Drop nan values
store_items.dropna(axis = 1)

         bikes  pants  watches
store 1     20     30       35
store 2     15      5       10
store 3     20     30       35

In [4]:
# Replace nan values
store_items.fillna(0)

         bikes  pants  watches  glasses
store 1     20     30       35      0.0
store 2     15      5       10     50.0
store 3     20     30       35      4.0

In [8]:
# Replace nan value with forward filing
store_items.fillna(method='ffill', axis =1 )

         bikes  pants  watches  glasses
store 1   20.0   30.0     35.0     35.0
store 2   15.0    5.0     10.0     50.0
store 3   20.0   30.0     35.0      4.0

In [11]:
# Replace nan value with linear interpolation
store_items.interpolate(method='linear', axis = 1 )

         bikes  pants  watches  glasses
store 1   20.0   30.0     35.0     35.0
store 2   15.0    5.0     10.0     50.0
store 3   20.0   30.0     35.0      4.0